#!/usr/bin/python3
import math
a = float(input("Введите коэффициент 'a'\n"))
b = float(input("Введите коэффициент 'b'\n"))
c = float(input("Введите коэффициент 'c'\n"))
if a == 0:
    print("Ошибка: если старший коэффицент равен нулю, то это не квадратное уравнение")
else:
    if b != 0 and c != 0:
        d = b**2-4*a*c
        if d > 0:
            x1 = (-b+math.sqrt(d))/(2*a)
            x2 = (-b-math.sqrt(d))/(2*a)
            print(f"Первый корень = {x1}, Второй корень равен = {x2}")
        elif d == 0:
            x1 = (-b + math.sqrt(d)) / (2 * a)
            print(f"Дискриминант равен нулю, единственный корень = {x1}")
        else:
            print("Отрицательный дискриминант - корней нет")
    elif b == 0 and c != 0:
        m = -c/a
        if m > 0:
            x1 = math.sqrt(m)
            x2 = -math.sqrt(m)
            print(f"Первый корень = {x1}, Второй корень равен = {x2}")
        else:
            print("Отрицательный результат деления 'с' на 'а' - корней нет")
    elif b != 0 and c == 0:
        x1 = 0.0
        x2 = -b/a
        print(f"Первый корень = {x1}, Второй корень равен = {x2}")
    else:
        print("Уравнение имеет единственный корень = 0.0")
